# DividedSurfaceAllPoints Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DividedSurfaceAllPoints Property
ParameterTypeId Class See Also
---
"Show all points"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DividedSurfaceAllPoints { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedSurfaceAllPoints As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DividedSurfaceAllPoints {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace